 Question 1: Given a list of tuples, find the number of occurrences of each tuple in the list.

In [ ]:

Input = [
          ('a', 'alex'),
          ('b', 'fred'),
          ('c', 'Ted'),
          ('d', 'Red'),
          ('p', 'Grey'),
          ('a', 'alex'),
          ('e', 'Frank'),
          ('d', 'Red'),
          ('i', 'Moon'),
          ('t', 'Tim'),
          ('b', 'fred'),
          ('c', 'Ted'),
          ('g', 'mandy'),
          ('a', 'alex'),
          ('p', 'Grey'),
          ('c', 'Ted'),
          ('e', 'Frank'),
          ('d', 'Red'),
          ('a', 'alex'),
          ('p', 'Grey'),
          ('t', 'Tim'),
          ('g', 'mandy'),
          ('c', 'Ted'),
          ('i', 'Moon'),
          ('b', 'fred'),
          ('a', 'alex'),
          ('i', 'Moon'),
          ('p', 'Grey'),
          ('d', 'Red'),
          ('g', 'mandy'),
          ('c', 'Ted'),
          ('p', 'Grey'),
          ('e', 'Frank'),
          ('t', 'Tim'),
          ('g', 'mandy'),
          ('p', 'Grey'),
          ('g', 'mandy'),
          ('i', 'Moon')
]

def occurence_count(Input):  
  import collections
  frequency = collections.defaultdict(int)

  for item in Input:
    frequency[item] += 1
  
  print("Total number of items = " + str(len(Input)))
  print("Total frequency count = " + str(sum([frequency[i] for i in frequency])))

  return frequency

print(occurence_count(Input))

Total number of items = 38
Total frequency count = 38
defaultdict(<class 'int'>, {('a', 'alex'): 5, ('b', 'fred'): 3, ('c', 'Ted'): 5, ('d', 'Red'): 4, ('p', 'Grey'): 6, ('e', 'Frank'): 3, ('i', 'Moon'): 4, ('t', 'Tim'): 3, ('g', 'mandy'): 5})

Question 2: Create a list of 10 random numbers between 1-100. Create a balanced BST (Binary search tree) from this array

In [ ]:

import random

def random_num_generator(n):
  random.seed(40)
  random_num_list = random.sample(range(1,101), n)
  return random_num_list

class Node:
  def __init__(self, key):
    self.left = None
    self.right = None
    self.node_value = key

def insert_key(root, key):
  if root == None :
    root = Node(key)
    return root

  else:
    if root.node_value == key:
      return root

    elif root.node_value > key :
      root.left = insert_key(root.left, key)
      return root

    else :
      root.right = insert_key(root.right, key)
      return root

def Build_BST(arr):
  root = None
  for i in arr:
    root = insert_key(root,i)
  return root

def show_inorder(node):
    if not node:
      return
    else:
        show_inorder(node.left)
        print(node.node_value)
        show_inorder(node.right)

input = random_num_generator(10)
print(input)

root_node = Build_BST(input)
show_inorder(root_node)

[59, 75, 68, 5, 32, 37, 86, 82, 27, 17]
5
17
27
32
37
59
68
75
82
86

 Question 3: Given the following dictionary:#

In [ ]:


# { ‘black :’r’,
#   ‘hero’:‘e’,
#   ‘go’:’g’,
#   ‘clue’:’i’,
#   ’mean’:’q’,
#   ’groan’:’o’,
#   ’sin’:’p’,
#   ’pint’:’u’,
#   ’tone’:’n’,
#   ’graze’:’s’,
#   ‘sea’:’t’,
#   ‘plant’:’a’}
# Create a list of all the keys of the dictionary, which can be formed from the values present in the dictionary.

from itertools import combinations 

def join(ls):
  str = ""
  for i in ls:
    str = str + i
  return str

dictionary = { 'black' :'r',
  'hero':'e',
  'go':'g',
  'clue':'i',
  'mean':'q',
  'groan':'o',
  'sin':'p',
  'pint':'u',
  'tone':'n',
  'graze':'s',
  'sea':'t',
  'plant':'a'}

m_set =set()

for i in dictionary:
  m_set.add(dictionary[i])

LIST = []
for i in range(1, len(m_set) + 1):
  LIST +=   list(
        map(
            join, 
            combinations(m_set, i)
            )
        )
print(len(m_set))
print(len(LIST))
print(2**len(m_set) - 1)
LIST

 Question 4: Given the following list of tuples,
 a.    sort the list by 1st item in the tuple in ascending order
 b.    Sort the list by 2nd item in the tuple in ascending order
 c.     Repeat a, b using descending order

In [ ]:
listA = [(1,2), (4,3), (2,10), (12, 5), (6, 7), (9,11), (15, 4)]

def key_a(i):
  return i[0]

def key_b(i):
  return i[1]

a = sorted(listA, key = key_a)
print(a)

b = sorted(listA, key = key_b)
print(b)

a_descending = sorted(listA, key = key_a, reverse = True)
print(a_descending)

b_descending = sorted(listA, key = key_b, reverse = True)
print(b_descending)

[(1, 2), (2, 10), (4, 3), (6, 7), (9, 11), (12, 5), (15, 4)]
[(1, 2), (4, 3), (15, 4), (12, 5), (6, 7), (2, 10), (9, 11)]
[(15, 4), (12, 5), (9, 11), (6, 7), (4, 3), (2, 10), (1, 2)]
[(9, 11), (2, 10), (6, 7), (12, 5), (15, 4), (4, 3), (1, 2)]

Question 5: What do you mean by a mutable and immutable object. Are string, list, tuple, dictionary mutable type objects or immutable objects.

Objects of built-in types like (int, float, bool, str, tuple, unicode) are immutable. Objects of built-in types like (list, set, dict) are mutable. Custom classes are generally mutable. 

Mutable objects:
list, dict, set, byte array

Immutable objects:
int, float, complex, string, tuple, frozen set, bytes

Question 6: Learn The usage of Pandas and Numpy:

In [ ]:
import pandas as pd
import numpy as np

df = pd.read_csv('banking.csv')

In [ ]:
df.head()

   age          job  marital  ... euribor3m nr_employed  y
0   44  blue-collar  married  ...     4.963      5228.1  0
1   53   technician  married  ...     4.021      5195.8  0
2   28   management   single  ...     0.729      4991.6  1
3   39     services  married  ...     1.405      5099.1  0
4   55      retired  married  ...     0.869      5076.2  1

[5 rows x 21 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41188 entries, 0 to 41187
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             41188 non-null  int64
 1   job             41188 non-null  object
 2   marital         41188 non-null  object
 3   education       41188 non-null  object
 4   default         41188 non-null  object
 5   housing         41188 non-null  object
 6   loan            41188 non-null  object
 7   contact         41188 non-null  object
 8   month           41188 non-null  object
 9   day_of_week     41188 non-null  object
 10  duration        41188 non-null  int64
 11  campaign        41188 non-null  int64
 12  pdays           41188 non-null  int64
 13  previous        41188 non-null  int64
 14  poutcome        41188 non-null  object
 15  emp_var_rate    41188 non-null  float64
 16  cons_price_idx  41188 non-null  float64
 17  cons_conf_idx   41188 non-null  float64
 18  euribor3m       41188 non-null  float64
 19  nr_employed     41188 non-null  float64
 20  y               41188 non-null  int64
dtypes: float64(5), int64(6), object(10)
memory usage: 6.6+ MB

6-1)Write the command to find unique values in education.

In [ ]:

df['education'].unique()

array(['basic.4y', 'unknown', 'university.degree', 'high.school',
       'basic.9y', 'professional.course', 'basic.6y', 'illiterate'],
      dtype=object)

In [ ]:
df['y'].unique()

array([0, 1])

6-2)Command to find the number of customers subscribed and not subscribed.

In [ ]:
df_y1 = df.where(df.y == 1).dropna()['y']
df_y0 = df.where(df.y == 0).dropna()['y']

print("Total number of customers = " + str(len(df_y0) + len(df_y1)))
print("Number of customes subscribed = " + str(len(df_y1)))
print("Number of customes not subscribed = " + str(len(df_y0)))

Total number of customers = 41188
Number of customes subscribed = 4640
Number of customes not subscribed = 36548

6-3)    Find the mean values of all the independent variables for every ‘y’ (outcome variable)

In [ ]:

df.groupby(['y']).mean()

         age    duration  campaign  ...  cons_conf_idx  euribor3m  nr_employed
y                                   ...
0  39.911185  220.844807  2.633085  ...     -40.593097   3.811491  5176.166600
1  40.913147  553.191164  2.051724  ...     -39.789784   2.123135  5095.115991

[2 rows x 10 columns]

6-4)    What is the mean age for every marital status

In [ ]:
df.groupby(['marital'])['age'].mean()

marital
divorced    44.899393
married     42.307165
single      33.158714
unknown     40.275000
Name: age, dtype: float64

6-5)    Check for null values

In [ ]:

df.isnull().values.any()

False